const nvsib = [
  {
    value: 1,
    group: 'Многодетные семьи',
    privileges: `"1) первоочередное предоставление мест в имеющих государственную аккредитацию государственных образовательных организациях высшего образования Новосибирской области или государственных профессиональных образовательных организациях Новосибирской области для детей из многодетных семей, сдавших единый государственный экзамен, при прочих равных условиях;(Пункт в редакции, введенной Законом НСО от 02.10.2014 N 465-ОЗ, - см. предыдущую редакцию)
2) первоочередное предоставление мест в дошкольных образовательных организациях Новосибирской области;(Пункт в редакции, введенной Законом НСО от 02.10.2014 N 465-ОЗ, - см. предыдущую редакцию)
3) - Пункт утратил силу - Закон НСО от 06.12.2013 N 379-ОЗ - см. предыдущую редакцию
4) компенсация расходов на оплату коммунальных услуг в размере 30 процентов (для многодетных семей, имеющих пять и более детей, компенсация в размере 50 процентов) платы за коммунальные услуги, но не более 30 процентов (для многодетных семей, имеющих пять и более детей, не более 50 процентов) от суммы размеров регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области, приходящегося на каждого члена многодетной семьи;(Пункт в редакции, введенной Законом НСО от 10.11.2017 N 217-ОЗ, - см. предыдущую редакцию)
5) обеспечение питанием на льготных условиях обучающихся государственных общеобразовательных организаций Новосибирской области, муниципальных общеобразовательных организаций, расположенных на территории Новосибирской области - детей из многодетных семей;(Пункт в редакции, введенной Законом НСО от 02.10.2014 N 465-ОЗ, - см. предыдущую редакцию)
6) право проезда по муниципальным и межмуниципальным маршрутам регулярных перевозок по регулируемым тарифам без взимания платы, по межмуниципальным маршрутам регулярных перевозок по нерегулируемым тарифам в объёме, установленном Правительством Новосибирской области, для детей, обучающихся в образовательных организациях всех типов на основании специального месячного проездного билета;(Пункт в редакции, введенной Законом НСО от 28.03.2017 N 150-ОЗ, - см. предыдущую редакцию)
7) бесплатное обеспечение лекарственными препаратами, приобретаемых по рецептам врачей, для детей в возрасте до 6 лет;(Пункт в редакции, введенной Законом НСО от 02.10.2014 N 465-ОЗ, - см. предыдущую редакцию)
8) ежегодная денежная выплата на приобретение одежды обучающихся для обучающихся в образовательных организациях, осуществляющих образовательную деятельность, по образовательным программам начального общего, основного общего и среднего общего образования;(Пункт в редакции, введенной Законом НСО от 18.12.2014 N 496-ОЗ, - см. предыдущую редакцию)
9) бесплатные образовательные услуги государственных организаций дополнительного образования детей Новосибирской области, муниципальных организаций дополнительного образования детей, расположенных на территории Новосибирской области;(Пункт в редакции, введенной Законом НСО от 02.10.2014 N 465-ОЗ, - см. предыдущую редакцию)
10) посещение на льготных условиях детьми из многодетных семей учреждений и организаций культуры, находящихся в ведении Новосибирской области;
11) содействие многодетным родителям (опекунам, попечителям), желающим создать крестьянские (фермерские) хозяйства, в выделении земельных участков;(Пункт в редакции, введенной Законом НСО от 18.12.2014 N 496-ОЗ, - см. предыдущую редакцию)
11.1) первоочередное бесплатное предоставление земельных участков, которое осуществляется в случаях и порядке, определенных Законом Новосибирской области от 5 декабря 2016 года N 112-ОЗ «Об отдельных вопросах регулирования земельных отношений на территории Новосибирской области» для предоставления земельных участков гражданам, имеющим трех и более детей;(Пункт в редакции, введенной Законом НСО от 10.11.2017 N 217-ОЗ, - см. предыдущую редакцию)
12) содействие в трудоустройстве многодетных родителей (опекунов, попечителей).(Пункт в редакции, введенной Законом НСО от 18.12.2014 N 496-ОЗ, - см. предыдущую редакцию)
13) ежемесячная денежная выплата в размере величины прожиточного минимума для детей, установленного на территории Новосибирской области на 1 января года, в котором предоставляется ежемесячная денежная выплата.(Пункт в редакции, введенной Законом НСО от 28.03.2017 N 150-ОЗ, - см. предыдущую редакцию)
2. Многодетным семьям, имеющим пять и более детей, устанавливаются дополнительные меры социальной поддержки:(Абзац в редакции, введенной Законом НСО от 07.11.2011 N 136-ОЗ, - см. предыдущую редакцию)
1) предоставление в первоочередном порядке детям из многодетных семей в возрасте от 7 лет и до 17 лет включительно путевок в организации отдыха детей и их оздоровления, расположенные на территории Новосибирской области;(Пункт в редакции, введенной Законом НСО от 28.03.2017 N 150-ОЗ, - см. предыдущую редакцию)
2) право проезда по муниципальным и межмуниципальным маршрутам регулярных перевозок по регулируемым тарифам без взимания платы, по межмуниципальным маршрутам регулярных перевозок по нерегулируемым тарифам в объёме, установленном Правительством Новосибирской области, для одного из родителей (опекунов, попечителей) на основании приобретаемого специального месячного проездного билета.(Пункт в редакции, введенной Законом НСО от 28.03.2017 N 150-ОЗ, - см. предыдущую редакцию)"
`
  },
  {
    value: 2,
    group: 'Работники образования',
    privileges: `компенсации расходов на оплату жилого помещения и коммунальных услуг в размере 100 процентов платы за жилое помещение и коммунальные услуги по горячему водоснабжению, холодному водоснабжению, водоотведению, электроснабжению, газоснабжению (в том числе поставкам бытового газа в баллонах), отоплению (теплоснабжению, в том числе поставкам твердого топлива при наличии печного отопления).
`
  },
  {
    value: 3,
    group: 'Специалисты областных государственных учреждений ветеринарии',
    privileges: `Гражданам, относящимся к категориям, указанным в пунктах 1-3, - части 1 статьи 1 настоящего Закона, предоставляется компенсация расходов на оплату жилого помещения и коммунальных услуг в размере 100 процентов платы за жилое помещение и коммунальные услуги по горячему водоснабжению, холодному водоснабжению, водоотведению, электроснабжению, газоснабжению (в том числе поставкам бытового газа в баллонах), отоплению (теплоснабжению, в том числе поставкам твердого топлива при наличии печного отопления), но не более 100 процентов от размера регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области.
`
  },
  {
    value: 4,
    group: 'Лица, подвергшиеся политическим репрессиям и впоследствии реабилитированные',
    privileges: `"1) ежемесячная денежная выплата в соответствии со статьей 6 настоящего Закона;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
2) денежная компенсация за установку квартирного телефона;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
3) денежная компенсация один раз в год в размере стоимости проезда (туда и обратно) железнодорожным транспортом и в размере 50 процентов стоимости проезда (туда и обратно) водным, воздушным или междугородным автомобильным транспортом в пределах территории Российской Федерации;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
4) бесплатное изготовление и ремонт зубных протезов (за исключением зубных протезов с опорой на дентальные имплантаты, а также изготовленных из драгоценных металлов и других дорогостоящих материалов) в медицинских организациях, участвующих в реализации территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области, бесплатное обеспечение другими протезно-ортопедическими изделиями;(Пункт в редакции, введенной Законом НСО от 29.04.2015 N 538-ОЗ, - см. предыдущую редакцию)
5) компенсация расходов на оплату жилого помещения и коммунальных услуг в размере 50 процентов платы за жилое помещение и коммунальные услуги, но не более 50 процентов от размера регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области.(Абзац в редакции, введенной Законом НСО от 05.07.2017 N 182-ОЗ, - см. предыдущую редакцию)
Размер указанной компенсации определяется с учетом платы за жилое помещение и коммунальные услуги членов семьи реабилитированного лица, совместно с ним проживающих, в размере 50 процентов платы за жилое помещение и коммунальные услуги, но не более 50 процентов от суммы размеров регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области, приходящегося на каждого такого члена семьи; (Пункт в редакции, введенной в действие 01.01.2014 Законом НСО от 06.12.2013 N 379-ОЗ, - см. предыдущую редакцию)
6) первоочередная установка квартирного телефона;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
7) внеочередной прием в организации социального обслуживания, предоставляющие социальные услуги в стационарной форме, в полустационарной форме, внеочередное обслуживание организациями социального обслуживания, предоставляющими социальные услуги в форме социального обслуживания на дому;(Пункт в редакции, введенной Законом НСО от 05.07.2017 N 182-ОЗ, - см. предыдущую редакцию)
8) внеочередное оказание медицинской помощи в медицинских организациях, участвующих в реализации территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
9) обеспечение лекарственными препаратами в соответствии со статьей 7 настоящего Закона;(Пункт в редакции, введенной Законом НСО от 01.04.2011 N 57-ОЗ, - см. предыдущую редакцию)
10) бесплатный проезд железнодорожным транспортом в пригородном сообщении в соответствии со статьей 8 настоящего Закона.(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)"
`
  },
  {
    value: 5,
    group: 'Лица, признанные пострадавшими от политических репрессий',
    privileges: `"1) ежемесячная денежная выплата в соответствии со статьей 6 настоящего Закона;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
2) внеочередное оказание медицинской помощи в медицинских организациях, участвующих в реализации территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
3) компенсация расходов на оплату жилого помещения и коммунальных услуг в размере 50 процентов платы за жилое помещение и коммунальные услуги, но не более 50 процентов от размера регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области.(Абзац в редакции, введенной Законом НСО от 05.07.2017 N 182-ОЗ, - см. предыдущую редакцию)
Размер указанной компенсации определяется с учетом платы за жилое помещение и коммунальные услуги членов семьи лица, признанного пострадавшим от политических репрессий, совместно с ним проживающих, в размере 50 процентов платы за жилое помещение и коммунальные услуги, но не более 50 процентов от суммы размеров регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области, приходящегося на каждого такого члена семьи;(Пункт в редакции, введенной в действие 01.01.2014 Законом НСО от 06.12.2013 N 379-ОЗ, - см. предыдущую редакцию)
4) первоочередная установка квартирного телефона;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
5) внеочередной прием в организации социального обслуживания, предоставляющие социальные услуги в стационарной форме, в полустационарной форме, внеочередное обслуживание организациями социального обслуживания, предоставляющими социальные услуги в форме социального обслуживания на дому;(Пункт в редакции, введенной Законом НСО от 05.07.2017 N 182-ОЗ, - см. предыдущую редакцию)
6) обеспечение лекарственными препаратами в соответствии со статьей 7 настоящего Закона;(Пункт в редакции, введенной Законом НСО от 01.04.2011 N 57-ОЗ, - см. предыдущую редакцию)
7) бесплатный проезд железнодорожным транспортом в пригородном сообщении в соответствии со статьей 8 настоящего Закона.(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)"
`
  },
  {
    value: 6,
    group: 'Лицам, проработавшим в тылу в период с 22 июня 1941 года по 9 мая 1945 года не менее шести месяцев, исключая период работы на временно оккупированных территориях СССР, либо награжденным орденами или медалями СССР самоотверженный труд в период Великой Отечественной войны',
    privileges: `"1) ежемесячная денежная выплата в соответствии со статьей 6 настоящего Закона;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
2) однократное бесплатное получение земельных участков в размерах, определяемых законодательством Новосибирской области, для жилищного строительства;
3) сохранение права на получение медицинской помощи в медицинских организациях, к которым указанные лица были прикреплены в период работы до выхода на пенсию, а также внеочередное оказание медицинской помощи в рамках территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области (в том числе прохождение ежегодной диспансеризации) в медицинских организациях (в том числе в госпиталях ветеранов войн), подведомственных исполнительным органам государственной власти Новосибирской области;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
4) бесплатное изготовление и ремонт зубных протезов (за исключением зубных протезов с опорой на дентальные имплантаты, а также изготовленных из драгоценных металлов и других дорогостоящих материалов) в медицинских организациях, участвующих в реализации территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области, а также бесплатное обеспечение другими протезами и протезно-ортопедическими изделиями;(Пункт в редакции, введенной Законом НСО от 29.04.2015 N 538-ОЗ, - см. предыдущую редакцию)
5) внеочередной прием в организации социального обслуживания, предоставляющие социальные услуги в стационарной форме, в полустационарной форме, внеочередное обслуживание организациями социального обслуживания, предоставляющими социальные услуги в форме социального обслуживания на дому;(Пункт в редакции, введенной Законом НСО от 05.07.2017 N 182-ОЗ, - см. предыдущую редакцию)
6) обеспечение лекарственными препаратами в соответствии со статьей 7 настоящего Закона;(Пункт в редакции, введенной Законом НСО от 01.04.2011 N 57-ОЗ, - см. предыдущую редакцию)
7) оплата в размере 50 процентов стоимости проезда железнодорожным транспортом в пригородном сообщении в соответствии со статьей 8 настоящего Закона.(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)"
`
  },
  {
    value: 7,
    group: 'Ветераны труда, а также граждане, приравненные к ним по состоянию на 31 декабря 2004 года, после установления (назначения) им страховой пенсии по старости',
    privileges: `"1) ежемесячная денежная выплата в соответствии со статьей 6 настоящего Закона;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
2) сохранение права на получение медицинской помощи в медицинских организациях, к которым указанные лица были прикреплены в период работы до выхода на пенсию, а также внеочередное оказание медицинской помощи в рамках территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области (в том числе прохождение ежегодной диспансеризации) в медицинских организациях (в том числе в госпиталях ветеранов войн), подведомственных исполнительным органам государственной власти Новосибирской области;(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)
3) бесплатное изготовление и ремонт зубных протезов (за исключением зубных протезов с опорой на дентальные имплантаты, а также изготовленных из драгоценных металлов и других дорогостоящих материалов) в медицинских организациях, участвующих в реализации территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области;(Пункт в редакции, введенной Законом НСО от 29.04.2015 N 538-ОЗ, - см. предыдущую редакцию)
4) компенсация расходов на оплату жилого помещения и коммунальных услуг в размере 50 процентов платы за жилое помещение и коммунальные услуги, но не более 50 процентов от размера регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области.(Абзац в редакции, введенной Законом НСО от 05.07.2017 N 182-ОЗ, - см. предыдущую редакцию)
Размер указанной компенсации определяется с учетом платы за жилое помещение и коммунальные услуги нетрудоспособных членов семьи ветерана труда, совместно с ним проживающих, находящихся на его полном содержании или получающих от него помощь, которая является для них постоянным и основным источником средств к существованию, в размере 50 процентов платы за жилое помещение и коммунальные услуги, но не более 50 процентов от суммы размеров регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области, приходящегося на каждого такого члена семьи;(Пункт в редакции, введенной в действие 01.01.2014 Законом НСО от 06.12.2013 N 379-ОЗ, - см. предыдущую редакцию)
5) - Пункт утратил силу с 01.01.2010 Законом НСО от 29.09.2009 N 388-ОЗ, - см. предыдущую редакцию
6) оплата в размере 50 процентов стоимости проезда железнодорожным транспортом в пригородном сообщении в сроки, установленные Правительством Новосибирской области, в соответствии со статьей 8 настоящего Закона.(Пункт в редакции, введенной Законом НСО от 02.04.2014 N 422-ОЗ, - см. предыдущую редакцию)"
`
  },
  {
    value: 8,
    group: 'Ветераны труда Новосибирской области',
    privileges: `"1) ежемесячная денежная выплата в соответствии со статьей 6 настоящего Закона;
2) бесплатное изготовление и ремонт зубных протезов (за исключением зубных протезов с опорой на дентальные имплантаты, а также изготовленных из драгоценных металлов и других дорогостоящих материалов) в медицинских организациях, участвующих в реализации территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области, и оплата в размере 50 процентов стоимости слуховых аппаратов;
3) компенсация расходов на оплату жилого помещения и коммунальных услуг в размере 50 процентов платы за жилое помещение и коммунальные услуги, но не более 50 процентов от размера регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области;
4) оплата в размере 50 процентов стоимости проезда железнодорожным транспортом в пригородном сообщении в соответствии со статьей 8 настоящего Закона в сроки, установленные Правительством Новосибирской области;
5) сохранение права на получение медицинской помощи в медицинских организациях, к которым указанные лица были прикреплены в период работы до выхода на пенсию, а также внеочередное оказание медицинской помощи в рамках территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области (в том числе прохождение ежегодной диспансеризации) в медицинских организациях (в том числе в госпиталях ветеранов войн), подведомственных областным исполнительным органам государственной власти Новосибирской области."
`
  },
  {
    value: 9,
    group: 'Лица, удостоенные званий Героя Социалистического Труда, Героя Труда Российской Федерации, и полным кавалерам ордена Трудовой Славы',
    privileges: `"ежемесячная денежная компенсация расходов на автомобильное топливо из расчета 100 литров высокооктанового бензина в месяц в соответствии с рыночными ценами на топливо, действовавшими в месяце, предшествующем тому, в котором производится ежемесячная денежная компенсация, лицам, имеющим в личном пользовании автотранспортное средство.
"
`
  },
  {
    value: 10,
    group: 'Лица, удостоенные почетных званий СССР, РСФСР или Российской Федерации',
    privileges: `"1) обеспечение лекарственными препаратами в соответствии со статьей 7 настоящего Закона;
2) компенсация расходов на оплату жилого помещения и коммунальных услуг в размере 50 процентов платы за жилое помещение и коммунальные услуги, но не более 50 процентов от размера регионального стандарта стоимости жилищно-коммунальных услуг, установленного Губернатором Новосибирской области;
3) бесплатный проезд железнодорожным транспортом в пригородном сообщении в соответствии со статьей 8 настоящего Закона"
`
  },
  {
    value: 11,
    group: 'Граждане, которым на момент окончания Великой Отечественной войны не исполнилось 18 лет и один из родителей которых в период с 22 июня 1941 года по 9 (11) мая 1945 года погиб (пропал без вести) при участии в боевых действиях по защите Отечества или нахождении в плену, умер в указанный период вследствие ранения, увечья или заболевания, полученных при защите Отечества или исполнении обязанностей военной службы на фронте, в районах боевых действий',
    privileges: `"1) ежемесячная денежная выплата в соответствии со статьей 6 настоящего Закона;
2) внеочередное оказание медицинской помощи в медицинских организациях, участвующих в реализации территориальной программы государственных гарантий бесплатного оказания гражданам медицинской помощи в Новосибирской области;
3) внеочередной прием в организации социального обслуживания, предоставляющие социальные услуги в стационарной форме, в полустационарной форме, внеочередное обслуживание организациями социального обслуживания, предоставляющими социальные услуги в форме социального обслуживания на дому."
`
  }
]

$(document).on('change', '#town', function(e){
  var value = e.target.value

  switch (value) {
    case "1": //новосибирск
      var resultList = '';
      var resultContent = '';
      for (var i = 0; i < nvsib.length; i++) {
        var newId = 'list-'+nvsib[i].value;
        var newList = `<a class="list-group-item list-group-item-action" id="${newId}-list" data-toggle="list" href="#${newId}" role="tab">${nvsib[i].group}</a>`;
        var newContent = `<div class="tab-pane fade" id="${newId}" role="tabpanel" aria-labelledby="${newId}-list">${nvsib[i].privileges}</div>`
        resultList += newList;
        resultContent += newContent;
      }
      $('#privileges-group').html(resultList)
      $('#privileges-content').html(resultContent)

      break;
    default:
      $('#privileges-group').html('<a class="list-group-item active text-light">Выберете город</a>')
      $('#privileges-content').html('Ваши льготы будут отображаться тут')
      break;
  }
});
